In [1]:
#7.1 Handling Missing Data

import pandas as pd
import numpy as np
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [2]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None

In [5]:
 string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [6]:
#Filtering Out Missing Data

from numpy import nan as NA

In [7]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [8]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])

In [11]:
cleaned = data.dropna()

In [12]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [14]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [15]:
data[4] = NA

In [16]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [17]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
df = pd.DataFrame(np.random.randn(7, 3))

In [19]:
df.iloc[:4, 1] = NA

In [20]:
df.iloc[:2, 2] = NA

In [21]:
df

          0         1         2
0 -1.383937       NaN       NaN
1  0.063288       NaN       NaN
2  1.783727       NaN -0.787026
3 -1.041555       NaN -0.158120
4 -1.177792 -0.507255  0.817968
5  2.034896 -0.584318 -2.842479
6 -0.658423 -0.649247 -1.098515

In [22]:
df.dropna()

          0         1         2
4 -1.177792 -0.507255  0.817968
5  2.034896 -0.584318 -2.842479
6 -0.658423 -0.649247 -1.098515

In [23]:
 df.dropna(thresh=2)

          0         1         2
2  1.783727       NaN -0.787026
3 -1.041555       NaN -0.158120
4 -1.177792 -0.507255  0.817968
5  2.034896 -0.584318 -2.842479
6 -0.658423 -0.649247 -1.098515

In [24]:
#Filling In Missing Data

df.fillna(0)

          0         1         2
0 -1.383937  0.000000  0.000000
1  0.063288  0.000000  0.000000
2  1.783727  0.000000 -0.787026
3 -1.041555  0.000000 -0.158120
4 -1.177792 -0.507255  0.817968
5  2.034896 -0.584318 -2.842479
6 -0.658423 -0.649247 -1.098515

In [25]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -1.383937  0.500000  0.000000
1  0.063288  0.500000  0.000000
2  1.783727  0.500000 -0.787026
3 -1.041555  0.500000 -0.158120
4 -1.177792 -0.507255  0.817968
5  2.034896 -0.584318 -2.842479
6 -0.658423 -0.649247 -1.098515

In [26]:
_ = df.fillna(0, inplace=True)

In [27]:
df

          0         1         2
0 -1.383937  0.000000  0.000000
1  0.063288  0.000000  0.000000
2  1.783727  0.000000 -0.787026
3 -1.041555  0.000000 -0.158120
4 -1.177792 -0.507255  0.817968
5  2.034896 -0.584318 -2.842479
6 -0.658423 -0.649247 -1.098515

In [28]:
df = pd.DataFrame(np.random.randn(6, 3))

In [29]:
 df.iloc[2:, 1] = NA

In [30]:
df.iloc[4:, 2] = NA

In [31]:
df

          0         1         2
0  1.081604  0.719967  1.445096
1 -0.252317  0.262774 -0.762522
2 -1.163800       NaN -1.226078
3 -0.856961       NaN -0.642735
4 -0.401651       NaN       NaN
5  1.307018       NaN       NaN

In [32]:
df.fillna(method='ffill')

          0         1         2
0  1.081604  0.719967  1.445096
1 -0.252317  0.262774 -0.762522
2 -1.163800  0.262774 -1.226078
3 -0.856961  0.262774 -0.642735
4 -0.401651  0.262774 -0.642735
5  1.307018  0.262774 -0.642735

In [33]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  1.081604  0.719967  1.445096
1 -0.252317  0.262774 -0.762522
2 -1.163800  0.262774 -1.226078
3 -0.856961  0.262774 -0.642735
4 -0.401651       NaN -0.642735
5  1.307018       NaN -0.642735

In [34]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  1.081604  0.719967  1.445096
1 -0.252317  0.262774 -0.762522
2 -1.163800  0.262774 -1.226078
3 -0.856961  0.262774 -0.642735
4 -0.401651       NaN -0.642735
5  1.307018       NaN -0.642735

In [35]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [36]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [37]:
#7.2 Data Transformation
#Removing Duplicates

data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})

In [38]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [39]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [40]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [41]:
data['v1'] = range(7)

In [42]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [43]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [44]:
#Transforming Data Using a Function or Mapping

data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 'corned beef', 'Bacon','pastrami', 'honey ham', 'nova lox'],'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [45]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [46]:
meat_to_animal = {  'bacon': 'pig',  'pulled pork': 'pig',  'pastrami': 'cow',  'corned beef': 'cow',  'honey ham': 'pig',  'nova lox': 'salmon'}

In [47]:
lowercased = data['food'].str.lower()

In [48]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [49]:
data['animal'] = lowercased.map(meat_to_animal)

In [50]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [51]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [52]:
#Replacing Values

data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [53]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [54]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [55]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [56]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [58]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [59]:
#Renaming Axis Indexes

data = pd.DataFrame(np.arange(12).reshape((3, 4)),
            index=['Ohio', 'Colorado', 'New York'],
                columns=['one', 'two', 'three', 'four'])

In [60]:
transform = lambda x: x[:4].upper()

In [61]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [62]:
data.index = data.index.map(transform)

In [63]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [65]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [66]:
data.rename(index={'OHIO': 'INDIANA'},
          columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [67]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [68]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [69]:
#Discretization and Binning

ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [70]:
bins = [18, 25, 35, 60, 100]

In [71]:
cats = pd.cut(ages, bins)

In [72]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [73]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [74]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [75]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [76]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64, left]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [77]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [78]:
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [79]:
data = np.random.rand(20)

In [80]:
pd.cut(data, 4, precision=2)

[(0.74, 0.96], (0.74, 0.96], (0.52, 0.74], (0.29, 0.52], (0.29, 0.52], ..., (0.74, 0.96], (0.74, 0.96], (0.29, 0.52], (0.069, 0.29], (0.069, 0.29]]
Length: 20
Categories (4, interval[float64, right]): [(0.069, 0.29] < (0.29, 0.52] < (0.52, 0.74] < (0.74, 0.96]]

In [81]:
data = np.random.randn(1000)  # Normally distributed

In [82]:
cats = pd.qcut(data, 4)  # Cut into quartiles

In [83]:
cats

[(-0.669, 0.0271], (0.0271, 0.676], (0.676, 3.292], (0.676, 3.292], (-3.909, -0.669], ..., (0.676, 3.292], (-3.909, -0.669], (-3.909, -0.669], (-0.669, 0.0271], (0.0271, 0.676]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.909, -0.669] < (-0.669, 0.0271] < (0.0271, 0.676] < (0.676, 3.292]]

In [84]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.188, 0.0271], (0.0271, 1.256], (0.0271, 1.256], (1.256, 3.292], (-3.909, -1.188], ..., (1.256, 3.292], (-3.909, -1.188], (-3.909, -1.188], (-1.188, 0.0271], (0.0271, 1.256]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.909, -1.188] < (-1.188, 0.0271] < (0.0271, 1.256] < (1.256, 3.292]]

In [85]:
#Detecting and Filtering Outliers

data = pd.DataFrame(np.random.randn(1000, 4))

In [86]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.002988    -0.006096     0.014809    -0.005910
std       1.016500     1.002067     1.027500     0.971947
min      -4.347809    -3.045168    -3.183778    -3.219347
25%      -0.654725    -0.688017    -0.704903    -0.663397
50%       0.031235     0.021499     0.006682    -0.046928
75%       0.689599     0.684687     0.758964     0.625170
max       3.429333     3.052288     3.020179     3.257081

In [87]:
col = data[2]

In [88]:
col[np.abs(col) > 3]

716    3.020179
781   -3.183778
Name: 2, dtype: float64

In [89]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
5   -3.809280  1.128399  0.495897 -0.143165
39  -4.347809 -0.659716  0.033275 -2.077275
96  -3.049050  0.878118 -1.114905  1.401884
381 -0.152054  3.052288  0.354918 -0.071138
632  3.429333 -1.169674  1.740730  0.309109
716 -0.465719 -0.759532  3.020179 -0.395913
728  0.606534  2.381562  1.165576  3.257081
753 -3.124699 -0.005526  2.356522  0.613890
781 -1.324669 -1.312755 -3.183778 -2.506055
803 -1.701667  0.820340 -1.689497 -3.219347
969 -0.857494 -3.045168 -0.109464  0.368354

In [90]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [91]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.004890    -0.006103     0.014973    -0.005947
std       1.006978     1.001772     1.026885     0.970414
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.654725    -0.688017    -0.704903    -0.663397
50%       0.031235     0.021499     0.006682    -0.046928
75%       0.689599     0.684687     0.758964     0.625170
max       3.000000     3.000000     3.000000     3.000000

In [92]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0  1.0 -1.0
1  1.0  1.0 -1.0 -1.0
2 -1.0  1.0  1.0 -1.0
3  1.0 -1.0 -1.0  1.0
4  1.0 -1.0 -1.0  1.0

In [93]:
#Permutation and Random Sampling

df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [95]:
sampler = np.random.permutation(5)

In [96]:
sampler

array([3, 1, 0, 4, 2])

In [97]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [98]:
df.take(sampler)

    0   1   2   3
3  12  13  14  15
1   4   5   6   7
0   0   1   2   3
4  16  17  18  19
2   8   9  10  11

In [99]:
df.sample(n=3)

    0   1   2   3
4  16  17  18  19
1   4   5   6   7
3  12  13  14  15

In [100]:
choices = pd.Series([5, 7, -1, 6, 4])

In [101]:
draws = choices.sample(n=10, replace=True)

In [102]:
draws

0    5
0    5
2   -1
0    5
2   -1
0    5
2   -1
2   -1
1    7
2   -1
dtype: int64

In [103]:
#Computing Indicator/Dummy Variables

df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})

In [104]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [105]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [106]:
df_with_dummy = df[['data1']].join(dummies)

In [107]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [110]:
#7.3 String Manipulation

#String Object Methods
val = 'a,b,  guido'

In [111]:
val.split(',')

['a', 'b', '  guido']

In [112]:
pieces = [x.strip() for x in val.split(',')]

In [113]:
pieces

['a', 'b', 'guido']

In [114]:
first, second, third = pieces

In [115]:
first + '::' + second + '::' + third

'a::b::guido'

In [116]:
'::'.join(pieces)

'a::b::guido'

In [117]:
'guido'in val

True

In [118]:
val.index(',')

1

In [119]:
val.find(':')

-1

In [120]:
val.count(',')

2

In [121]:
val.replace(',', '::')

'a::b::  guido'

In [122]:
val.replace(',', '')

'ab  guido'

In [123]:
#Regular Expressions

import re

In [124]:
text = "foo    bar\t baz  \tqux"

In [125]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [126]:
regex = re.compile('\s+')

In [127]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [128]:
regex.findall(text)

['    ', '\t ', '  \t']

In [129]:
text = """Dave dave@google.comSteve steve@gmail.comRob rob@gmail.comRyan ryan@yahoo.com"""

In [131]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [132]:
regex.findall(text)

['dave@google.comS', 'steve@gmail.comR', 'rob@gmail.comR', 'ryan@yahoo.com']

In [133]:
m = regex.search(text)

In [134]:
m

In [135]:
text[m.start():m.end()]

'dave@google.comS'

In [136]:
print(regex.match(text))

None

In [137]:
print(regex.sub('REDACTED', text))

Dave REDACTEDteve REDACTEDob REDACTEDyan REDACTED

In [138]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [139]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [140]:
m = regex.match('wesm@bright.net')

In [141]:
m.groups()

('wesm', 'bright', 'net')

In [142]:
regex.findall(text)

[('dave', 'google', 'comS'),
 ('steve', 'gmail', 'comR'),
 ('rob', 'gmail', 'comR'),
 ('ryan', 'yahoo', 'com')]

In [143]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: comSteve Username: steve, Domain: gmail, Suffix: comRob Username: rob, Domain: gmail, Suffix: comRyan Username: ryan, Domain: yahoo, Suffix: com

In [144]:
#Vectorized String Functions in pandas

data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [145]:
data = pd.Series(data)

In [146]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [147]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [148]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [149]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [150]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [151]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [152]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [154]:
matches.str.get(1)

AttributeError: Can only use .str accessor with string values!

In [155]:
matches.str[0]

AttributeError: Can only use .str accessor with string values!

In [156]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object